"""
начало

вывод: укажите длины трех отрезков
записать значение отрезка A
записать значение отрезка B
записать значение отрезка C
сравнить значения длины сторон
если все стороны равны
    вывод: треугольник равносторонний
    конец
если есть наибольшая сторона,
    сравнить ее длину с суммой длин других
    если длинна больше суммы двух других
        вывод: построение треугольника невозможно
        конец
сравнить две другие стороны
если стороны равны
    вывод: треугольник равнобедренный
    конец
иначе
    вывод: треугольник разносторонний
    конец
"""

